NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/version_handler.c
    event_handler_critical_section_end();

    return i;
}

/** Find or allocate the given handle, and give it a value.
  Returns the index of the handle in the cache */
static uint16_t handle_version_set(rbc_mesh_value_handle_t handle,
        uint16_t version,
        bool* cache_hit,
        int16_t* delta)
{
    uint16_t i = handle_entry_to_head(handle);
    if (i == HANDLE_CACHE_ENTRY_INVALID)
    {
        APP_ERROR_CHECK(NRF_ERROR_NO_MEM);
    }

    *delta = vh_get_version_delta(m_handle_cache[i].version, version);
    *cache_hit = (m_handle_cache[i].version > 0);

    if (*delta > 0)
    {
        m_handle_cache[i].version = version;
    }

    return i;
}

/** Find or allocate the given handle in the cache, and increment the version.
  Returns the index of the handle in the cache. */
static uint16_t handle_version_increment(rbc_mesh_value_handle_t handle)
{
    uint16_t i = handle_entry_to_head(handle);
    if (i == HANDLE_CACHE_ENTRY_INVALID)
    {
        APP_ERROR_CHECK(NRF_ERROR_NO_MEM);
    }

    version_increment(&m_handle_cache[i].version);

    return i;
}

static void transmit_all_instances(uint64_t timestamp);

static void order_next_transmission(uint64_t time_now)
{
    uint64_t ts_begin_time = timeslot_get_global_time();
    uint64_t ts_end_time = timeslot_get_end_time();
    uint64_t earliest = UINT64_MAX;
    uint16_t handle_index = m_handle_cache_head;

    do
    {
        uint16_t data_index = m_handle_cache[handle_index].data_entry;
        if (data_index != DATA_CACHE_ENTRY_INVALID &&
            m_data_cache[data_index].p_packet != NULL &&
            m_data_cache[data_index].trickle.t < earliest
        )
        {
            earliest = m_data_cache[data_index].trickle.t;
        }

        handle_index = m_handle_cache[handle_index].index_next;

    } while (handle_index != m_handle_cache_tail);

    if (earliest < ts_end_time)
    {
        timer_order_cb(TIMER_INDEX_VH, earliest - ts_begin_time, transmit_all_instances);
    }
}

static void transmit_all_instances(uint64_t timestamp)
{
    /* the framework continues where it left off */
    static uint16_t data_index = 0;

    uint64_t ts_begin_time = timeslot_get_global_time();

    for (uint32_t i = 0; i < RBC_MESH_DATA_CACHE_ENTRIES; ++i)
    {
        while (data_index >= RBC_MESH_DATA_CACHE_ENTRIES)
            data_index -= RBC_MESH_DATA_CACHE_ENTRIES;

        if ((m_data_cache[data_index].p_packet != NULL) &&
            (m_data_cache[data_index].trickle.t <= timestamp + ts_begin_time))
        {
            bool do_tx = false;
            trickle_tx_timeout(&m_data_cache[data_index].trickle, &do_tx, timestamp + ts_begin_time);
            if (do_tx)
            {
                uint32_t error_code = tc_tx(m_data_cache[data_index].p_packet);

                if (error_code == NRF_SUCCESS)
                {
                    /* the handle is queued for transmission */
                    trickle_tx_register(&m_data_cache[data_index].trickle);
                }
                else
                {
                    /* the radio queue is full, tc will notify us when it's available again */
                    TICK_PIN(PIN_TC_QUEUE_FULL);
                    break;
                }
            }
        }
        data_index++;
    }

    order_next_transmission(timestamp);
}

/** compare payloads, assuming version number is equal */
static bool payload_has_conflict(mesh_adv_data_t* p_old_adv, mesh_adv_data_t* p_new_adv)
{
    if (p_old_adv == NULL ||
        p_new_adv == NULL ||
        (p_old_adv->adv_data_length !=
        p_new_adv->adv_data_length))
    {
        return true;
    }

    return (memcmp(p_old_adv->data, p_new_adv->data, p_old_adv->adv_data_length - MESH_PACKET_ADV_OVERHEAD) != 0);
}

/******************************************************************************
* Interface functions
******************************************************************************/
uint32_t vh_init(uint32_t min_interval_us)
{
    uint32_t error_code = vh_min_interval_set(min_interval_us);
    if (error_code != NRF_SUCCESS)
    {
        return error_code;
    }

    for (uint32_t i = 0; i < RBC_MESH_DATA_CACHE_ENTRIES; ++i)
    {
        trickle_timer_reset(&m_data_cache[i].trickle, 0);
        m_data_cache[i].p_packet = NULL;
    }

    for (uint32_t i = 0; i < RBC_MESH_HANDLE_CACHE_ENTRIES; ++i)
    {
        m_handle_cache[i].handle = RBC_MESH_INVALID_HANDLE;
        m_handle_cache[i].version = 0;
        m_handle_cache[i].persistent = 0;
        m_handle_cache[i].tx_event = 0;
        m_handle_cache[i].data_entry = DATA_CACHE_ENTRY_INVALID;
        m_handle_cache[i].index_prev = i - 1;
        m_handle_cache[i].index_next = i + 1;
    }
    m_handle_cache_head = 0;
    m_handle_cache_tail = RBC_MESH_HANDLE_CACHE_ENTRIES - 1;
    m_handle_cache[m_handle_cache_head].index_prev = HANDLE_CACHE_ENTRY_INVALID;
    m_handle_cache[m_handle_cache_tail].index_next = HANDLE_CACHE_ENTRY_INVALID;

    g_is_initialized = true;
    return NRF_SUCCESS;
}

uint32_t vh_min_interval_set(uint32_t min_interval_us)
{
    if (min_interval_us < RBC_MESH_INTERVAL_MIN_MIN_MS * 1000 ||
        min_interval_us > RBC_MESH_INTERVAL_MIN_MAX_MS * 1000)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    trickle_setup(min_interval_us, MESH_TRICKLE_I_MAX, MESH_TRICKLE_K);

    return NRF_SUCCESS;
}

vh_data_status_t vh_rx_register(mesh_adv_data_t* p_adv_data, uint64_t timestamp)
{
    if (!g_is_initialized)
        return VH_DATA_STATUS_UNKNOWN;

    mesh_packet_t* p_packet = mesh_packet_get_aligned(p_adv_data);
    if (p_packet == NULL)
    {
        return VH_DATA_STATUS_UNKNOWN;
    }

    bool cache_hit = false;
    int16_t delta = 0;
    uint16_t handle_index = handle_version_set(p_adv_data->handle, p_adv_data->version, &cache_hit, &delta);
    uint16_t data_index = m_handle_cache[handle_index].data_entry;
    uint64_t ts_start_time = timeslot_get_global_time();

    if (delta < 0)
    {
        /* the incoming packet is old */
        if (data_index != DATA_CACHE_ENTRY_INVALID)
        {
            trickle_rx_inconsistent(&m_data_cache[data_index].trickle, ts_start_time + timestamp);
            vh_order_update(0);
        }
        return VH_DATA_STATUS_OLD;
    }
    else if (delta == 0)
    {
        /* the incoming packet has the same version as the current */
        if (data_index == DATA_CACHE_ENTRY_INVALID)
        {
            /* no entry, no way of proving conflict */
            return VH_DATA_STATUS_SAME;
        }

