NordicPlayground/nRF51-ble-bcast-mesh/nRF51/rbc_mesh/src/version_handler.c
    const uint64_t ts_time = timer_get_timestamp();
    const uint64_t time_now = ts_time + timeslot_get_global_time();
    uint16_t handle_index = handle_entry_to_head(handle);
    uint16_t data_index = m_handle_cache[handle_index].data_entry;

    if (data_index == DATA_CACHE_ENTRY_INVALID)
    {
        data_index = data_entry_allocate();
        if (!mesh_packet_acquire(&m_data_cache[data_index].p_packet))
        {
            return NRF_ERROR_NO_MEM;
        }

        /* build a dummy packet to request data, as we don't know the contents of the packet */
        uint32_t error_code = mesh_packet_build(m_data_cache[data_index].p_packet,
                handle,
                0,
                NULL,
                0);
        if (error_code != NRF_SUCCESS)
        {
            mesh_packet_ref_count_dec(m_data_cache[data_index].p_packet); /* free the newly acquired packet */
            m_data_cache[data_index].p_packet = NULL;
            return NRF_ERROR_INTERNAL;
        }

        m_handle_cache[handle_index].data_entry = data_index;
        trickle_timer_reset(&m_data_cache[data_index].trickle, time_now);
    }
    else
    {
        trickle_enable(&m_data_cache[data_index].trickle);
    }

    vh_order_update(ts_time);

    return NRF_SUCCESS;
}

uint32_t vh_value_disable(rbc_mesh_value_handle_t handle)
{
    if (!g_is_initialized)
        return NRF_ERROR_INVALID_STATE;

    uint16_t handle_index = handle_entry_get(handle);
    if (handle_index == HANDLE_CACHE_ENTRY_INVALID)
    {
        return NRF_ERROR_NOT_FOUND;
    }

    uint16_t data_index = m_handle_cache[handle_index].data_entry;

    if (data_index != DATA_CACHE_ENTRY_INVALID)
    {
        trickle_disable(&m_data_cache[data_index].trickle);
    }

    return NRF_SUCCESS;
}

uint32_t vh_value_is_enabled(rbc_mesh_value_handle_t handle, bool* p_is_enabled)
{
    if (!g_is_initialized)
        return NRF_ERROR_INVALID_STATE;

    if (handle == RBC_MESH_INVALID_HANDLE)
    {
        return NRF_ERROR_INVALID_ADDR;
    }

    uint16_t handle_index = handle_entry_to_head(handle);
    if (handle_index == HANDLE_CACHE_ENTRY_INVALID)
    {
        *p_is_enabled = false;
        return NRF_SUCCESS;
    }

    uint16_t data_index = m_handle_cache[handle_index].data_entry;
    if (data_index == DATA_CACHE_ENTRY_INVALID)
    {
        *p_is_enabled = false;
        return NRF_SUCCESS;
    }

    *p_is_enabled = trickle_is_enabled(&m_data_cache[data_index].trickle);
    return NRF_SUCCESS;
}

uint32_t vh_value_persistence_set(rbc_mesh_value_handle_t handle, bool persistent)
{
    if (!g_is_initialized)
        return NRF_ERROR_INVALID_STATE;

    if (handle == RBC_MESH_INVALID_HANDLE)
    {
        return NRF_ERROR_INVALID_ADDR;
    }

    uint16_t handle_index = handle_entry_to_head(handle);
    if (handle_index == HANDLE_CACHE_ENTRY_INVALID)
    {
        return NRF_ERROR_NOT_FOUND;
    }

    m_handle_cache[handle_index].persistent = persistent;

    return NRF_SUCCESS;
}

uint32_t vh_value_persistence_get(rbc_mesh_value_handle_t handle, bool* p_persistent)
{
    if (!g_is_initialized)
        return NRF_ERROR_INVALID_STATE;

    if (handle == RBC_MESH_INVALID_HANDLE)
    {
        return NRF_ERROR_INVALID_ADDR;
    }

    uint16_t handle_index = handle_entry_to_head(handle);
    if (handle_index == HANDLE_CACHE_ENTRY_INVALID)
    {
        return NRF_ERROR_NOT_FOUND;
    }

    *p_persistent = m_handle_cache[handle_index].persistent;

    return NRF_SUCCESS;
}

